<h1>Cara menghubungkan jupyter notebook dengan mysql</h1>

Install dulu mysql.connector

In [1]:
#import mysql.connector
import mysql.connector

In [4]:
#connecting dengan database mysql dengan username dan passord sesuai dengan database mysql
databaseku = mysql.connector.connect(host="localhost", user="username", password="password")
print(databaseku)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000023EC840C908>

In [35]:
#membuat database inventaris
kursor = databaseku.cursor()
kursor.execute("CREATE DATABASE inventaris")

In [36]:
#memunculkan database
kursor = databaseku.cursor()
kursor.execute("SHOW DATABASES")
for database in kursor:
    print(database)

('information_schema',)
('inventaris',)
('inventori',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [37]:
#Gunakan database inventaris
kursor = databaseku.cursor()
kursor.execute("USE inventaris")

In [38]:
#membuat tabel Ruangdi database inventaris
kursor = databaseku.cursor()
kursor.execute("CREATE TABLE Ruang (Noruang char(4) primary key, Blokgedung varchar(30) not null, Lantai int unsigned not null, Fungsi varchar(30), Luas int unsigned)")

In [39]:
#menampilkan tabel
kursor = databaseku.cursor()
kursor.execute("SHOW tables")
for tabel_ruang in kursor:
    print(tabel_ruang)

print("--------------------------------------")
#menampilkan deskripsi tabel
kursor = databaseku.cursor()
kursor.execute("Describe Ruang")
for desc_ruang in kursor:
    print(desc_ruang)

('ruang',)
--------------------------------------
('Noruang', 'char(4)', 'NO', 'PRI', None, '')
('Blokgedung', 'varchar(30)', 'NO', '', None, '')
('Lantai', 'int(10) unsigned', 'NO', '', None, '')
('Fungsi', 'varchar(30)', 'YES', '', None, '')
('Luas', 'int(10) unsigned', 'YES', '', None, '')

In [40]:
#menambah kolom baru (misal: kolom kapasitas)
kursor = databaseku.cursor()
kursor.execute("ALTER TABLE Ruang ADD Kapasitas int unsigned not null")

In [41]:
kursor.execute("describe ruang")
for desc_ruang in kursor:
    print(desc_ruang)

('Noruang', 'char(4)', 'NO', 'PRI', None, '')
('Blokgedung', 'varchar(30)', 'NO', '', None, '')
('Lantai', 'int(10) unsigned', 'NO', '', None, '')
('Fungsi', 'varchar(30)', 'YES', '', None, '')
('Luas', 'int(10) unsigned', 'YES', '', None, '')
('Kapasitas', 'int(10) unsigned', 'NO', '', None, '')

In [42]:
#menampilkan tabel pada mysql kedalam bentuk pandas dataframe
#import pandas dan sqlalchemy
import pandas as pd
from sqlalchemy import create_engine 
engine = create_engine("mysql+mysqlconnector://username:password@localhost/namadatabase")

#menampilkan deskripsi tabel ruang kedalam dataframe df1
query=("Describe Ruang")
print("Tabel 1. Deskripsi Ruang")
print("   ")
df1 = pd.read_sql(query, engine)
print(df1)

Tabel 1. Deskripsi Ruang

        Field              Type Null  Key Default Extra
0     Noruang           char(4)   NO  PRI    None
1  Blokgedung       varchar(30)   NO         None
2      Lantai  int(10) unsigned   NO         None
3      Fungsi       varchar(30)  YES         None
4        Luas  int(10) unsigned  YES         None
5   Kapasitas  int(10) unsigned   NO         None

In [43]:
#Memasukan data kedalam tabel inventaris
kursor = databaseku.cursor()
query = ("Insert into Ruang(Noruang, Blokgedung, Lantai, Fungsi, Luas, Kapasitas) VALUES(%s, %s, %s, %s, %s, %s)")
values = [
    ("A101", "A", 1, "Ruang Kuliah", 60, 55),
    ("A102", "A", 1, "Ruang Kuliah", 60, 55),
    ("A103", "A", 1, "Ruang Kuliah", 72, 65)
]
kursor.executemany(query, values)
databaseku.commit()
print(print(kursor.rowcount, "was inserted."))

3 was inserted.
None

In [58]:
#menampilkan tabel ruang
databaseku = mysql.connector.connect(host="localhost",user="username",passwd="password",database="inventaris")
kursor = databaseku.cursor()
kursor.execute("SELECT * FROM Ruang")
output = kursor.fetchall()
for data in output:
    print(data)

print("  ")
#menampilkan tabel Ruang kedalam dataframe df2
query=("SELECT * FROM Ruang")
print("Tabel 2. Tabel Ruang")
print("   ")
df2 = pd.read_sql(query, engine)
print(df2)

('A101', 'A', 1, 'Ruang Kuliah', 60, 55)
('A102', 'A', 1, 'Ruang Kuliah', 60, 55)
('A103', 'A', 1, 'Ruang Kuliah', 72, 65)

Tabel 2. Tabel Ruang

  Noruang Blokgedung  Lantai        Fungsi  Luas  Kapasitas
0    A101          A       1  Ruang Kuliah    60         55
1    A102          A       1  Ruang Kuliah    60         55
2    A103          A       1  Ruang Kuliah    72         65